INSERT INTO public.document (id,description,numeral,series,title,doc_id,type_code) VALUES
                                                                                         (1,NULL,'54545','4545','Свидетельство о рождении',1,'01'),
                                                                                         (2,NULL,'380672','5616','Паспорт гражданина РФ',2,'02'),
                                                                                         (3,NULL,'12314','2133','Вид на жительство в РФ',3,'03'),
                                                                                         (4,NULL,'99 63 43134',NULL,'Водительское удостоверение',4,'04'),
                                                                                         (5,NULL,'5395372',NULL,'Трудовая книжка',5,'05'),
                                                                                         (6,NULL,'583-329-535-02',NULL,'СНИЛС',6,'06'),
                                                                                         (7,NULL,'842','481849814','Страховой полис',7,'07');

INSERT INTO public.doc_type (id,code,name) VALUES
                                            (1,'01','Свидетельство о рождении'),
                                            (2,'02','Паспорт гражданина РФ'),
                                            (3,'03','Вид на жительство в РФ'),
                                            (4,'04','Водительское удостоверение'),
                                            (5,'05','Трудовая книжка'),
                                            (6,'06','СНИЛС'),
                                            (7,'07','Страховой полис');

INSERT INTO public.person (adress,birthdate,citizenship,debt_amount,email,first_name,gender,last_name,middle_name,phone,"document") VALUES
                                                                                                                                        ('улица «Пахтачи», дом № 61','1998.10.31','Узбекистан','45893','norboev@mail.ru','Норбоев','Мужчина','Мухедин','Исломбек','+79964003212','1'),
                                                                                                                                        ('Проспект строителей, 67','2003.01.20','Россия','30000','eggurin2033@gmail.com','Гурин','Мужчина','Васильевич','Егор','+79374005191','2'),
                                                                                                                                        ('улица Молланепеса, 23','1981.09.22','Туркменистан','78321','serdar1981@mail.ru','Сердар ','Мужчина','Гурбангулыевич ','Бердымухамедов ','+79007377312','3'),
                                                                                                                                        ('улица Пацаева, 2','2003.06.20','Россия','15600','mary2003@gmail.com','Мария','Женщина','Вячеславовна','Денисова','+79968000590','4'),
                                                                                                                                        ('улица Богданова 103, 67','2002.10.03','Россия','84281','alex2002@gmail.com','Александр','Мужчина','Владимирович','Солдатов','+79521930438','5'),
                                                                                                                                        ('улица Вишневая, 102','1973.05.09','Россия','63149','vasgur1973@gmail.com','Василий','Мужской','Васильевич','Гурин','+79273893665','6'),
                                                                                                                                        ('улица Московская, 110','1982.04.23','Россия','64174','gudkovk@mail.ru','Кирилл','Мужской','Владимирович','Гудков','+76413481264','7');
INSERT INTO public.app_user (id,app_user_role,email,enabled,first_name,last_name,"locked","password",user_id) VALUES
    (1,'USER','user@mail.ru',true,'Test','User',false,'$2a$10$D7ZBl48D.DQh5Qn37wBF0eapGNFf2Sduvss7k3X2TpKIWi4MKRDAS','1');

INSERT INTO public.account (id,amount,phone,app_user,card) VALUES
    (1,NULL,'+79374005191','1','1');


